exampleCases/bubbleSheetorg/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;

vertices
(
    (0    0 -0.01)
    (100  0 -1.01)
    (1000 0 -10.01)
    
    (0    2000 -0.01)
    (100  2000 -1.01)
    (1000 2000 -10.01)
    
    (0    0 0.01)
    (100  0 1.01)
    (1000 0 10.01)
    
    (0    2000 0.01)
    (100  2000 1.01)
    (1000 2000 10.01)
);

blocks
(
    hex (0 1 4 3 6 7 10 9)  (10 200 1) simpleGrading (1 1 1)
    hex (1 2 5 4 7 8 11 10) (90 200 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (3 4 10 9)
    )
    symmetryPlane left
    (
        (0 3 9 6)
    )
    patch outlet
    (
        (2 5 11 8)
    )
    wall top
    (
        (4 5 11 10)
    )
    wedge front
    (
        (0 1 4 3)
        (1 2 5 4)
    )
    wedge back
    (
        (6 7 10 9)
        (7 8 11 10)
    )
    wall interface
    (
        (0 1 7 6)
        (1 2 8 7)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
