exampleCases/bubbleSheetorg/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       315334;
    }
    left
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          551;
        startFace       315344;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       315895;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       316095;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          157817;
        startFace       316185;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          157817;
        startFace       474002;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3301;
        startFace       631819;
    }
)

// ************************************************************************* //
